[
  {
    "_id": "cmp_001",
    "title": "Clean Water for All",
    "slug": "clean-water-for-all",
    "description": "Clean Water for All is a vital initiative aimed at transforming lives through dedicated support and meaningful outreach. Our goal is to create lasting impact by addressing the root causes of inequality, providing resources, and empowering individuals. We work closely with local partners and volunteers to deliver high-quality services and promote sustainable solutions. Through your support, we can extend our reach and ensure that no one is left behind in our journey toward a better world. Join us in securing safe water access for rural communities that currently lack reliable clean water sources.",
    "short_description": "Clean Water for All is about creating impact, promoting equity, and delivering sustainable solutions to secure clean water in rural communities.",
    "images": [
      "https://images.pexels.com/photos/6591147/pexels-photo-6591147.jpeg?auto=compress&cs=tinysrgb&w=600"
    ],
    "videos": ["https://example.com/videos/water1.mp4"],
    "target_amount": 5000,
    "received_amount": 1850,
    "status": "active",
    "category": "health",
    "tags": [
      "water",
      "health",
      "rural",
      "sustainability",
      "community",
      "development",
      "aid",
      "support",
      "nonprofit",
      "impact"
    ],
    "created_by": "usr_001",
    "created_at": "2025-06-01T08:00:00.000Z",
    "updated_at": "2025-06-10T12:30:00.000Z"
  },
  {
    "_id": "cmp_002",
    "title": "Educate a Child",
    "slug": "educate-a-child",
    "description": "Educate a Child is a vital initiative aimed at transforming lives through dedicated support and meaningful outreach. Our goal is to create lasting impact by addressing the root causes of inequality, providing resources, and empowering individuals. We work closely with local partners and volunteers to deliver high-quality services and promote sustainable solutions. Through your support, we can extend our reach and ensure that no one is left behind in our journey toward a better world. Join us in supporting education access for underprivileged children who struggle to attend school consistently.",
    "short_description": "Educate a Child is about creating impact, promoting equity, and delivering sustainable solutions to support underprivileged kids in accessing quality education.",
    "images": [
      "https://images.pexels.com/photos/6646778/pexels-photo-6646778.jpeg?auto=compress&cs=tinysrgb&w=600"
    ],
    "videos": [],
    "target_amount": 10000,
    "received_amount": 7400,
    "status": "active",
    "category": "education",
    "tags": [
      "education",
      "children",
      "school",
      "community",
      "empowerment",
      "volunteer",
      "support",
      "nonprofit",
      "impact",
      "development"
    ],
    "created_by": "usr_002",
    "created_at": "2025-05-20T10:00:00.000Z",
    "updated_at": "2025-06-09T11:00:00.000Z"
  },
  {
    "_id": "cmp_003",
    "title": "Tree Plantation Drive",
    "slug": "tree-plantation-drive",
    "description": "Tree Plantation Drive is a vital initiative aimed at transforming lives through dedicated support and meaningful outreach. Our goal is to create lasting impact by addressing the root causes of inequality, providing resources, and empowering individuals. We work closely with local partners and volunteers to deliver high-quality services and promote sustainable solutions. Through your support, we can extend our reach and ensure that no one is left behind in our journey toward a better world. Join us in planting 10,000 trees this year to restore ecosystems, fight climate change, and benefit communities with cleaner air and greener landscapes.",
    "short_description": "Tree Plantation Drive is about creating impact, promoting equity, and delivering sustainable solutions through planting trees to restore ecosystems and benefit communities.",
    "images": [
      "https://images.pexels.com/photos/6995106/pexels-photo-6995106.jpeg?auto=compress&cs=tinysrgb&w=600",
      "https://example.com/images/trees2.jpg"
    ],
    "videos": [],
    "target_amount": 3000,
    "received_amount": 3100,
    "status": "completed",
    "category": "environment",
    "tags": [
      "trees",
      "green",
      "nature",
      "sustainability",
      "community",
      "volunteer",
      "impact",
      "development",
      "support",
      "change"
    ],
    "created_by": "usr_003",
    "created_at": "2025-04-15T09:00:00.000Z",
    "updated_at": "2025-06-01T10:30:00.000Z"
  },
  {
    "_id": "cmp_004",
    "title": "Disaster Relief Fund",
    "slug": "disaster-relief-fund",
    "description": "Disaster Relief Fund is a vital initiative aimed at transforming lives through dedicated support and meaningful outreach. Our goal is to create lasting impact by addressing the root causes of inequality, providing resources, and empowering individuals. We work closely with local partners and volunteers to deliver high-quality services and promote sustainable solutions. Through your support, we can extend our reach and ensure that no one is left behind in our journey toward a better world. Join us in providing urgent help to flood-affected families, delivering food, shelter, and medical care to those impacted by natural disasters.",
    "short_description": "Disaster Relief Fund is about creating impact, promoting equity, and delivering sustainable solutions to provide urgent help to flood-affected families in need.",
    "images": [
      "https://images.pexels.com/photos/6647119/pexels-photo-6647119.jpeg?auto=compress&cs=tinysrgb&w=600"
    ],
    "videos": ["https://example.com/videos/floods.mp4"],
    "target_amount": 20000,
    "received_amount": 12500,
    "status": "active",
    "category": "emergency",
    "tags": [
      "flood",
      "relief",
      "emergency",
      "aid",
      "support",
      "community",
      "volunteer",
      "nonprofit",
      "impact",
      "hope"
    ],
    "created_by": "usr_004",
    "created_at": "2025-06-01T14:00:00.000Z",
    "updated_at": "2025-06-08T16:00:00.000Z"
  },
  {
    "_id": "cmp_005",
    "title": "Meals for the Homeless",
    "slug": "meals-for-the-homeless",
    "description": "Meals for the Homeless is a vital initiative aimed at transforming lives through dedicated support and meaningful outreach. Our goal is to create lasting impact by addressing the root causes of inequality, providing resources, and empowering individuals. We work closely with local partners and volunteers to deliver high-quality services and promote sustainable solutions. Through your support, we can extend our reach and ensure that no one is left behind in our journey toward a better world. Join us in delivering daily meals to homeless individuals, providing nourishment, dignity, and hope to those in need across our city.",
    "short_description": "Meals for the Homeless is about creating impact, promoting equity, and delivering sustainable solutions by providing nourishment, dignity, and hope daily.",
    "images": [
      "https://images.pexels.com/photos/6995106/pexels-photo-6995106.jpeg?auto=compress&cs=tinysrgb&w=600"
    ],
    "videos": [],
    "target_amount": 8000,
    "received_amount": 3500,
    "status": "active",
    "category": "food",
    "tags": [
      "meals",
      "homeless",
      "charity",
      "community",
      "support",
      "volunteer",
      "nonprofit",
      "impact",
      "aid",
      "hope"
    ],
    "created_by": "usr_005",
    "created_at": "2025-06-02T08:30:00.000Z",
    "updated_at": "2025-06-09T13:20:00.000Z"
  },
  {
    "_id": "cmp_006",
    "title": "Mental Health Awareness",
    "slug": "mental-health-awareness",
    "description": "Mental Health Awareness is a vital initiative aimed at transforming lives through dedicated support and meaningful outreach. Our goal is to create lasting impact by addressing the root causes of inequality, providing resources, and empowering individuals. We work closely with local partners and volunteers to deliver high-quality services and promote sustainable solutions. Through your support, we can extend our reach and ensure that no one is left behind in our journey toward a better world. Join us in raising awareness about mental health issues, providing counseling services, and reducing stigma in our communities.",
    "short_description": "Mental Health Awareness is about creating impact, promoting equity, and delivering sustainable solutions to raise awareness and provide support for mental health issues.",
    "images": [
      "https://images.pexels.com/photos/6646778/pexels-photo-6646778.jpeg?auto=compress&cs=tinysrgb&w=600"
    ],
    "videos": [],
    "target_amount": 6000,
    "received_amount": 4200,
    "status": "active",
    "category": "health",
    "tags": [
      "mental health",
      "awareness",
      "support",
      "community",
      "counseling",
      "nonprofit",
      "impact",
      "education",
      "stigma",
      "wellness"
    ],
    "created_by": "usr_006",
    "created_at": "2025-06-03T10:00:00.000Z",
    "updated_at": "2025-06-10T15:00:00.000Z"
  },
  {
    "_id": "cmp_007",
    "title": "Animal Rescue and Care",
    "slug": "animal-rescue-and-care",
    "description": "Animal Rescue and Care is a vital initiative aimed at transforming lives through dedicated support and meaningful outreach. Our goal is to create lasting impact by addressing the root causes of inequality, providing resources, and empowering individuals. We work closely with local partners and volunteers to deliver high-quality services and promote sustainable solutions. Through your support, we can extend our reach and ensure that no one is left behind in our journey toward a better world. Join us in rescuing abandoned animals, providing medical care, and finding loving homes for them.",
    "short_description": "Animal Rescue and Care is about creating impact, promoting equity, and delivering sustainable solutions to rescue, care for, and find homes for abandoned animals.",
    "images": [
      "https://images.pexels.com/photos/6995106/pexels-photo-6995106.jpeg?auto=compress&cs=tinysrgb&w=600"
    ],
    "videos": [],
    "target_amount": 7000,
    "received_amount": 4800,
    "status": "active",
    "category": "animals",
    "tags": [
      "animal rescue",
      "care",
      "adoption",
      "community",
      "support",
      "volunteer",
      "nonprofit",
      "impact",
      "shelter",
      "love"
    ],
    "created_by": "usr_007",
    "created_at": "2025-06-04T11:00:00.000Z",
    "updated_at": "2025-06-11T14:00:00.000Z"
  },
  {
    "_id": "cmp_008",
    "title": "Support for the Elderly",
    "slug": "support-for-the-elderly",
    "description": "Support for the Elderly is a vital initiative aimed at transforming lives through dedicated support and meaningful outreach. Our goal is to create lasting impact by addressing the root causes of inequality, providing resources, and empowering individuals. We work closely with local partners and volunteers to deliver high-quality services and promote sustainable solutions. Through your support, we can extend our reach and ensure that no one is left behind in our journey toward a better world. Join us in providing companionship, healthcare, and essential services to elderly individuals in need.",
    "short_description": "Support for the Elderly is about creating impact, promoting equity, and delivering sustainable solutions to provide companionship and essential services to seniors.",
    "images": [
      "https://images.pexels.com/photos/6646778/pexels-photo-6646778.jpeg?auto=compress&cs=tinysrgb&w=600"
    ],
    "videos": [],
    "target_amount": 4000,
    "received_amount": 2200,
    "status": "active",
    "category": "community",
    "tags": [
      "elderly",
      "support",
      "community",
      "healthcare",
      "companionship",
      "nonprofit",
      "impact",
      "volunteer",
      "care",
      "dignity"
    ],
    "created_by": "usr_008",
    "created_at": "2025-06-05T12:00:00.000Z",
    "updated_at": "2025-06-12T13:00:00.000Z"
  },
  {
    "_id": "cmp_009",
    "title": "Youth Empowerment Program",
    "slug": "youth-empowerment-program",
    "description": "Youth Empowerment Program is a vital initiative aimed at transforming lives through dedicated support and meaningful outreach. Our goal is to create lasting impact by addressing the root causes of inequality, providing resources, and empowering individuals. We work closely with local partners and volunteers to deliver high-quality services and promote sustainable solutions. Through your support, we can extend our reach and ensure that no one is left behind in our journey toward a better world. Join us in empowering young people through education, mentorship, and skill development.",
    "short_description": "Youth Empowerment Program is about creating impact, promoting equity, and delivering sustainable solutions to empower young people through education and mentorship.",
    "images": [
      "https://images.pexels.com/photos/6646778/pexels-photo-6646778.jpeg?auto=compress&cs=tinysrgb&w=600"
    ],
    "videos": [],
    "target_amount": 9000,
    "received_amount": 5000,
    "status": "active",
    "category": "education",
    "tags": [
      "youth",
      "empowerment",
      "education",
      "mentorship",
      "community",
      "support",
      "nonprofit",
      "impact",
      "development",
      "skills"
    ],
    "created_by": "usr_009",
    "created_at": "2025-06-06T13:00:00.000Z",
    "updated_at": "2025-06-13T12:00:00.000Z"
  },
  {
    "_id": "cmp_010",
    "title": "Clean Energy Initiative",
    "slug": "clean-energy-initiative",
    "description": "Clean Energy Initiative is a vital initiative aimed at transforming lives through dedicated support and meaningful outreach. Our goal is to create lasting impact by addressing the root causes of inequality, providing resources, and empowering individuals. We work closely with local partners and volunteers to deliver high-quality services and promote sustainable solutions. Through your support, we can extend our reach and ensure that no one is left behind in our journey toward a better world. Join us in promoting renewable energy solutions to reduce carbon footprints and foster sustainable communities.",
    "short_description": "Clean Energy Initiative is about creating impact, promoting equity, and delivering sustainable solutions through renewable energy projects for a greener future.",
    "images": [
      "https://images.pexels.com/photos/6646778/pexels-photo-6646778.jpeg?auto=compress&cs=tinysrgb&w=600"
    ],
    "videos": [],
    "target_amount": 15000,
    "received_amount": 8000,
    "status": "active",
    "category": "environment",
    "tags": [
      "clean energy",
      "renewable",
      "sustainability",
      "community",
      "support",
      "nonprofit",
      "impact",
      "development",
      "climate change",
      "green"
    ],
    "created_by": "usr_010",
    "created_at": "2025-06-07T14:00:00.000Z",
    "updated_at": "2025-06-14T11:00:00.000Z"
  },
  {
    "_id": "cmp_011",
    "title": "Digital Literacy for Seniors",
    "slug": "digital-literacy-for-seniors",
    "description": "Digital Literacy for Seniors is a vital initiative aimed at transforming lives through dedicated support and meaningful outreach. Our goal is to create lasting impact by addressing the root causes of inequality, providing resources, and empowering individuals. We work closely with local partners and volunteers to deliver high-quality services and promote sustainable solutions. Through your support, we can extend our reach and ensure that no one is left behind in our journey toward a better world. Join us in teaching digital skills to seniors, helping them connect with loved ones and access essential services online.",
    "short_description": "Digital Literacy for Seniors is about creating impact, promoting equity, and delivering sustainable solutions by teaching digital skills to seniors for better connectivity.",
    "images": [
      "https://images.pexels.com/photos/6646778/pexels-photo-6646778.jpeg?auto=compress&cs=tinysrgb&w=600"
    ],
    "videos": [],
    "target_amount": 5000,
    "received_amount": 3000,
    "status": "active",
    "category": "education",
    "tags": [
      "digital literacy",
      "seniors",
      "education",
      "community",
      "support",
      "nonprofit",
      "impact",
      "technology",
      "skills",
      "connectivity"
    ],
    "created_by": "usr_011",
    "created_at": "2025-06-08T15:00:00.000Z",
    "updated_at": "2025-06-15T10:00:00.000Z"
  },
  {
    "_id": "cmp_012",
    "title": "Food Security Program",
    "slug": "food-security-program",
    "description": "Food Security Program is a vital initiative aimed at transforming lives through dedicated support and meaningful outreach. Our goal is to create lasting impact by addressing the root causes of inequality, providing resources, and empowering individuals. We work closely with local partners and volunteers to deliver high-quality services and promote sustainable solutions. Through your support, we can extend our reach and ensure that no one is left behind in our journey toward a better world. Join us in ensuring access to nutritious food for low-income families, reducing hunger and improving health outcomes.",
    "short_description": "Food Security Program is about creating impact, promoting equity, and delivering sustainable solutions to ensure access to nutritious food for low-income families.",
    "images": [
      "https://images.pexels.com/photos/6646778/pexels-photo-6646778.jpeg?auto=compress&cs=tinysrgb&w=600"
    ],
    "videos": [],
    "target_amount": 12000,
    "received_amount": 6000,
    "status": "active",
    "category": "food",
    "tags": [
      "food security",
      "hunger",
      "community",
      "support",
      "nonprofit",
      "impact",
      "nutrition",
      "health",
      "development",
      "aid"
    ],
    "created_by": "usr_012",
    "created_at": "2025-06-09T16:00:00.000Z",
    "updated_at": "2025-06-16T09:00:00.000Z"
  },
  {
    "_id": "cmp_013",
    "title": "Cultural Heritage Preservation",
    "slug": "cultural-heritage-preservation",
    "description": "Cultural Heritage Preservation is a vital initiative aimed at transforming lives through dedicated support and meaningful outreach. Our goal is to create lasting impact by addressing the root causes of inequality, providing resources, and empowering individuals. We work closely with local partners and volunteers to deliver high-quality services and promote sustainable solutions. Through your support, we can extend our reach and ensure that no one is left behind in our journey toward a better world. Join us in preserving cultural heritage sites, promoting local traditions, and fostering community pride.",
    "short_description": "Cultural Heritage Preservation is about creating impact, promoting equity, and delivering sustainable solutions to preserve cultural heritage sites and traditions.",
    "images": [
      "https://images.pexels.com/photos/6646778/pexels-photo-6646778.jpeg?auto=compress&cs=tinysrgb&w=600"
    ],
    "videos": [],
    "target_amount": 8000,
    "received_amount": 4500,
    "status": "active",
    "category": "culture",
    "tags": [
      "cultural heritage",
      "preservation",
      "community",
      "support",
      "nonprofit",
      "impact",
      "tradition",
      "history",
      "development",
      "pride"
    ],
    "created_by": "usr_013",
    "created_at": "2025-06-10T17:00:00.000Z",
    "updated_at": "2025-06-17T08:00:00.000Z"
  },
  {
    "_id": "cmp_014",
    "title": "Disability Inclusion Program",
    "slug": "disability-inclusion-program",
    "description": "Disability Inclusion Program is a vital initiative aimed at transforming lives through dedicated support and meaningful outreach. Our goal is to create lasting impact by addressing the root causes of inequality, providing resources, and empowering individuals. We work closely with local partners and volunteers to deliver high-quality services and promote sustainable solutions. Through your support, we can extend our reach and ensure that no one is left behind in our journey toward a better world. Join us in promoting accessibility, providing resources, and advocating for the rights of individuals with disabilities.",
    "short_description": "Disability Inclusion Program is about creating impact, promoting equity, and delivering sustainable solutions to advocate for the rights and inclusion of individuals with disabilities.",
    "images": [
      "https://images.pexels.com/photos/6646778/pexels-photo-6646778.jpeg?auto=compress&cs=tinysrgb&w=600"
    ],
    "videos": [],
    "target_amount": 7000,
    "received_amount": 3000,
    "status": "active",
    "category": "community",
    "tags": [
      "disability",
      "inclusion",
      "accessibility",
      "community",
      "support",
      "nonprofit",
      "impact",
      "advocacy",
      "rights",
      "empowerment"
    ],
    "created_by": "usr_014",
    "created_at": "2025-06-11T18:00:00.000Z",
    "updated_at": "2025-06-18T07:00:00.000Z"
  },
  {
    "_id": "cmp_015",
    "title": "Water Conservation Awareness",
    "slug": "water-conservation-awareness",
    "description": "Water Conservation Awareness is a vital initiative aimed at transforming lives through dedicated support and meaningful outreach. Our goal is to create lasting impact by addressing the root causes of inequality, providing resources, and empowering individuals. We work closely with local partners and volunteers to deliver high-quality services and promote sustainable solutions. Through your support, we can extend our reach and ensure that no one is left behind in our journey toward a better world. Join us in raising awareness about water conservation practices, promoting sustainable usage, and protecting our precious water resources.",
    "short_description": "Water Conservation Awareness is about creating impact, promoting equity, and delivering sustainable solutions to raise awareness and promote sustainable water usage.",
    "images": [
      "https://images.pexels.com/photos/6646778/pexels-photo-6646778.jpeg?auto=compress&cs=tinysrgb&w=600",
      "https://images.pexels.com/photos/6646778/pexels-photo-6646778.jpeg?auto=compress&cs=tinysrgb&w=600",
      "https://images.pexels.com/photos/6646778/pexels-photo-6646778.jpeg?auto=compress&cs=tinysrgb&w=600",
      "https://images.pexels.com/photos/6646778/pexels-photo-6646778.jpeg?auto=compress&cs=tinysrgb&w=600",
      "https://images.pexels.com/photos/6646778/pexels-photo-6646778.jpeg?auto=compress&cs=tinysrgb&w=600",
      "https://images.pexels.com/photos/6646778/pexels-photo-6646778.jpeg?auto=compress&cs=tinysrgb&w=600",
      "https://images.pexels.com/photos/6646778/pexels-photo-6646778.jpeg?auto=compress&cs=tinysrgb&w=600",
      "https://images.pexels.com/photos/6646778/pexels-photo-6646778.jpeg?auto=compress&cs=tinysrgb&w=600",
      "https://images.pexels.com/photos/6646778/pexels-photo-6646778.jpeg?auto=compress&cs=tinysrgb&w=600",
      "https://images.pexels.com/photos/6646778/pexels-photo-6646778.jpeg?auto=compress&cs=tinysrgb&w=600",
      "https://images.pexels.com/photos/6646778/pexels-photo-6646778.jpeg?auto=compress&cs=tinysrgb&w=600",
      "https://images.pexels.com/photos/6646778/pexels-photo-6646778.jpeg?auto=compress&cs=tinysrgb&w=600",
      "https://images.pexels.com/photos/6646778/pexels-photo-6646778.jpeg?auto=compress&cs=tinysrgb&w=600",
      "https://images.pexels.com/photos/6646778/pexels-photo-6646778.jpeg?auto=compress&cs=tinysrgb&w=600",
      "https://images.pexels.com/photos/6646778/pexels-photo-6646778.jpeg?auto=compress&cs=tinysrgb&w=600"
    ],
    "videos": [
      "https://videos.pexels.com/video-files/32210388/13737627_2560_1440_24fps.mp4"
    ],
    "target_amount": 4000,
    "received_amount": 2000,
    "status": "active",
    "category": "environment",
    "tags": [
      "water conservation",
      "awareness",
      "sustainability",
      "community",
      "support",
      "nonprofit",
      "impact",
      "education",
      "resources",
      "protection"
    ],
    "created_by": "usr_015",
    "created_at": "2025-06-12T19:00:00.000Z",
    "updated_at": "2025-06-19T06:00:00.000Z"
  }
]
